geosmall/Arduino_Core_STM32/boards.txt
GenH7.menu.upload_method.clipboard=Clipboard (Copy Path)
GenH7.menu.upload_method.clipboard.upload.protocol=0
GenH7.menu.upload_method.clipboard.upload.options=-g
GenH7.menu.upload_method.clipboard.upload.tool=clipboard_upload

################################################################################
# Flight Controller Boards

FlightCtr.name=Flight Controller Boards

FlightCtr.build.core=arduino
FlightCtr.build.board=Genericflight
FlightCtr.build.variant_h=variant_{build.board}.h
FlightCtr.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
FlightCtr.build.fpu=-mfpu=fpv4-sp-d16
FlightCtr.build.float-abi=-mfloat-abi=hard
FlightCtr.build.flash_offset=0x0
FlightCtr.build.uf2_flash_offset=0x0
FlightCtr.upload.maximum_size=0
FlightCtr.upload.maximum_data_size=0

# Upload menu
FlightCtr.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
FlightCtr.menu.upload_method.swdMethod.upload.protocol=0
FlightCtr.menu.upload_method.swdMethod.upload.options=
FlightCtr.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

FlightCtr.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
FlightCtr.menu.upload_method.serialMethod.upload.protocol=1
FlightCtr.menu.upload_method.serialMethod.upload.options={serial.port.file}
FlightCtr.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

FlightCtr.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
FlightCtr.menu.upload_method.dfuMethod.upload.protocol=2
FlightCtr.menu.upload_method.dfuMethod.upload.options=
FlightCtr.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

FlightCtr.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
FlightCtr.menu.upload_method.jlinkMethod.upload.protocol=3
FlightCtr.menu.upload_method.jlinkMethod.upload.options=
FlightCtr.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

FlightCtr.menu.upload_method.bootuf2Method=UF2 Bootloader
FlightCtr.menu.upload_method.bootuf2Method.upload.protocol=uf2
FlightCtr.menu.upload_method.bootuf2Method.upload.tool=uf2_upload
FlightCtr.menu.upload_method.bootuf2Method.build.flash_offset={build.uf2_flash_offset}
FlightCtr.menu.upload_method.bootuf2Method.build.bootloader_flags=-DBL_BOOTUF2

FlightCtr.menu.upload_method.clipboard=Clipboard (Copy Path)
FlightCtr.menu.upload_method.clipboard.upload.protocol=0
FlightCtr.menu.upload_method.clipboard.upload.options=-g
FlightCtr.menu.upload_method.clipboard.upload.tool=clipboard_upload

# BlackPill F411CE 8MHz
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ=BlackPill F411CE 8MHz
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.upload.maximum_size=458752
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.upload.maximum_data_size=131072
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.mcu=cortex-m4
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.series=STM32F4xx
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.board=BLACKPILL_F411CE_8MHZ
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.product_line=STM32F411xE
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.variant=STM32F4xx/F411C(C-E)(U-Y)
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.variant_h=variant_BLACKPILL_F411CE_8MHZ.h
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.uf2_family=0x57755a57
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.uf2_flash_offset=0x10000

# OpenPilot Revolution F405
FlightCtr.menu.pnum.OPEN_REVO=OpenPilot Revo F4 (OPEN)
FlightCtr.menu.pnum.OPEN_REVO.upload.maximum_size=983040
FlightCtr.menu.pnum.OPEN_REVO.upload.maximum_data_size=131072
FlightCtr.menu.pnum.OPEN_REVO.build.mcu=cortex-m4
FlightCtr.menu.pnum.OPEN_REVO.build.series=STM32F4xx
FlightCtr.menu.pnum.OPEN_REVO.build.board=OPEN_REVO
FlightCtr.menu.pnum.OPEN_REVO.build.product_line=STM32F405xx
FlightCtr.menu.pnum.OPEN_REVO.build.variant=STM32F4xx/F405RGT_F415RGT
FlightCtr.menu.pnum.OPEN_REVO.build.variant_h=variant_OPEN_REVO.h
FlightCtr.menu.pnum.OPEN_REVO.build.uf2_family=0x57755a57
FlightCtr.menu.pnum.OPEN_REVO.build.uf2_flash_offset=0x10000

################################################################################
# Serialx activation
Nucleo_144.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_144.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_144.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_144.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_144.menu.xserial.disabled.build.xSerial=

Nucleo_64.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_64.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_64.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_64.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_64.menu.xserial.disabled.build.xSerial=

Nucleo_32.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_32.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_32.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_32.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_32.menu.xserial.disabled.build.xSerial=

GenF4.menu.xserial.generic=Enabled (generic 'Serial')
GenF4.menu.xserial.none=Enabled (no generic 'Serial')
GenF4.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF4.menu.xserial.disabled=Disabled (no Serial support)
GenF4.menu.xserial.disabled.build.xSerial=

GenF7.menu.xserial.generic=Enabled (generic 'Serial')
GenF7.menu.xserial.none=Enabled (no generic 'Serial')
GenF7.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF7.menu.xserial.disabled=Disabled (no Serial support)
GenF7.menu.xserial.disabled.build.xSerial=

GenG4.menu.xserial.generic=Enabled (generic 'Serial')
GenG4.menu.xserial.none=Enabled (no generic 'Serial')
GenG4.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenG4.menu.xserial.disabled=Disabled (no Serial support)
GenG4.menu.xserial.disabled.build.xSerial=

GenH7.menu.xserial.generic=Enabled (generic 'Serial')
GenH7.menu.xserial.none=Enabled (no generic 'Serial')
GenH7.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenH7.menu.xserial.disabled=Disabled (No Serial support)
GenH7.menu.xserial.disabled.build.xSerial=

FlightCtr.menu.xserial.generic=Enabled (generic 'Serial')
FlightCtr.menu.xserial.none=Enabled (no generic 'Serial')
FlightCtr.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
FlightCtr.menu.xserial.disabled=Disabled (no Serial support)
FlightCtr.menu.xserial.disabled.build.xSerial=

# USB connectivity
Nucleo_144.menu.usb.none=None
Nucleo_144.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Nucleo_144.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Nucleo_144.menu.usb.CDC=CDC (no generic 'Serial')
Nucleo_144.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Nucleo_144.menu.usb.HID=HID (keyboard and mouse)
Nucleo_144.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
Nucleo_144.menu.xusb.FS=Low/Full Speed
Nucleo_144.menu.xusb.HS=High Speed
Nucleo_144.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Nucleo_144.menu.xusb.HSFS=High Speed in Full Speed mode
Nucleo_144.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

Nucleo_64.menu.usb.none=None
Nucleo_64.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Nucleo_64.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Nucleo_64.menu.usb.CDC=CDC (no generic 'Serial')
Nucleo_64.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Nucleo_64.menu.usb.HID=HID (keyboard and mouse)
Nucleo_64.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
Nucleo_64.menu.xusb.FS=Low/Full Speed
Nucleo_64.menu.xusb.HS=High Speed
Nucleo_64.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Nucleo_64.menu.xusb.HSFS=High Speed in Full Speed mode
Nucleo_64.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

Nucleo_32.menu.usb.none=None
Nucleo_32.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Nucleo_32.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Nucleo_32.menu.usb.CDC=CDC (no generic 'Serial')
Nucleo_32.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Nucleo_32.menu.usb.HID=HID (keyboard and mouse)
Nucleo_32.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
Nucleo_32.menu.xusb.FS=Low/Full Speed
Nucleo_32.menu.xusb.HS=High Speed
Nucleo_32.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Nucleo_32.menu.xusb.HSFS=High Speed in Full Speed mode
Nucleo_32.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

GenF4.menu.usb.none=None
GenF4.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
GenF4.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
GenF4.menu.usb.CDC=CDC (no generic 'Serial')
GenF4.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
GenF4.menu.usb.HID=HID (keyboard and mouse)
GenF4.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
GenF4.menu.xusb.FS=Low/Full Speed
GenF4.menu.xusb.HS=High Speed
GenF4.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
GenF4.menu.xusb.HSFS=High Speed in Full Speed mode
GenF4.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

